import 'package:less_projects/classes/book_and_film.dart';

final List<Book> testBooks = [
  new Book(
      id: "0",
      name: "Война и Мир",
      author: "Лев Николаевич Толстой",
      info:
          'Война и мир" - самый известный роман Л.Н.Толстого, как никакое другое произведение писателя, отражает глубину его мироощущения и философии. Эта книга из разряда вечных, потому что она обо всем - о жизни и смерти, о любви и чести, о мужестве и героизме, о славе и подвиге, о войне и мире.',
      link: 'https://eksmo.ru/book/voyna-i-mir-tom-i-ii-4301306/',
      picUrl:
          'https://cdn.eksmo.ru/v2/ITD000000000807091/COVER/cover1__w600.jpg'),
  new Book(
    id: "1",
    name: "1984",
    author: "Джордж Оруэлл",
    info:
        'Своеобразный антипод второй великой антиутопии XX века - "О дивный новый мир" Олдоса Хаксли. Что, в сущности, страшнее: доведенное до абсурда "общество потребления" - или доведенное до абсолюта "общество идеи"?\nПо Оруэллу, нет и не может быть ничего ужаснее тотальной несвободы...',
    link: 'https://book24.ru/product/1984-191342/',
    picUrl:
        'https://cdn.book24.ru/v2/AST000000000130417/COVER/cover3d1__w674.jpg',
  ),
  new Book(
    id: "2",
    name: "Лолита",
    author: "Владимир Набоков",
    info:
        '«Лолита» — третий американский роман Владимира Набокова — увидела свет в 1955 году. Вызвав скандал по обе стороны океана, эта книга вознесла автора на вершину литературного Олимпа и стала одним из самых известных и, без сомнения, самых великих произведений XX века. Сегодня, когда полемические страсти вокруг «Лолиты» уже давно улеглись, можно уверенно сказать, что это книга о великой любви, преодолевшей болезнь, смерть и время, любви, разомкнутой в бесконечность, «любви с первого взгляда, с последнего взгляда, с извечного взгляда».',
    link: 'https://www.ozon.ru/context/detail/id/24860852/',
    picUrl: 'https://cdn1.ozone.ru/s3/multimedia-3/wc1200/6008463387.jpg',
  ),
  new Book(
    id: "3",
    name: "На маяк",
    author: "Вирджиния Вулф",
    info:
        '"На маяк" – книга категорически необычная. Два дня, разделенные десятилетним промежутком времени. Изображенные идеи, настроения и духовный опыт. Память, с помощью которой постепенно и незаметно в этот тонкий и изящный роман входит большая жизнь. Таково самое знаменитое произведение Вирджинии Вулф. На его страницах большая семьи Рэмзи, проводя лето на острове Скай, мечтает отправиться к маяку, который виден с их берега. Ежедневно миссис Рэмзи сообщает, что отец отвезет их туда на следующий день. Однако поездка все откладывается и откладывается. Описав эту историю, Вулф сумела нарисовать причудливый объемный рисунок человеческих взаимоотношений и рассказать, как и что думают женщины и мужчины, пока их никто не слышит.',
    link: 'https://eksmo.ru/book/na-mayak-ITD840330/',
    picUrl: 'https://cdn.eksmo.ru/v2/ITD000000000840330/COVER/cover1__w600.jpg',
  ),
  new Book(
    id: "4",
    name: "Илиада",
    author: "Гомер",
    info:
        'Предания о богах и героях, мифы и подлинные события тесно переплелись в героико-эпической поэме Гомера "Илиада", повествующей об одном из поворотных моментов истории Древней Греции - десятилетней осаде Трои.',
    link: 'https://eksmo.ru/book/iliada-ITD567667/',
    picUrl: 'https://cdn.eksmo.ru/v2/ITD000000000567667/COVER/cover1__w600.jpg',
  ),
  new Book(
    id: "5",
    name: "Одиссея",
    author: "Гомер",
    info:
        'Поэмы Гомера оказали огромное воздействие на мировую литературу, обогатили поэзию каноническим размером - гекзаметром, дали пищу историкам быта и нравов той эпохи. Сюжеты "Одиссеи" вдохновили многих художников и скульпторов на создание бессмертных шедевров.',
    link: 'https://eksmo.ru/book/odisseya-ITD829301/',
    picUrl: 'https://cdn.eksmo.ru/v2/ITD000000000829301/COVER/cover1__w600.jpg',
  ),
];
/*List<String> books = [
    '10_nigret.jpg',
    'bezmolv_pacient.jpg',
    'face_with_shram.jpg',
    'five_five.jpg',
    'girl_in_train.webp',
    'i_find_you.jpg',
    'sherlok_holmse.jpg',
    'telefonist.jpg',
    'the_one.jpg',
    'dnk_geniya.jpg',
    'harry.jpg',
    'harry1.png',
    'harry2.jpeg',
    '20_tis_lye_pod_vodoy.jpg',
    'beliy_klik.jpg',
    'dva_capitana.jpg',
    'tainstven_ostrov.jpg',
    'tri_mushketera.jpg',
    'dvacyat_let_spustya.jpg',
    'deti_kapitana_granta.jpg',
    '1984.jpg',
    'jack_london.jpg',
    '451_po_fareng.jpg',
    'belaya_gvardiya.jpg',
    'finansist.jpg',
    'kriscniy_otec.jpg',
    'morskoy_volk.jpg',
    'nad_propastyu_vo_rzi.jpg',
    'zov_predkov.jpg',
    'vsadnic_bez_golovi.jpg',
  ];*/
